Documents/Решение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Решение</Name>
			<BasedOn>
				<xr:Item>Document.ЛичноеДело</xr:Item>
				<xr:Item>Document.Талоны</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Решение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявленияДата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРешения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РешенияОтказыПоЛичнымДелам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НормативноПравовыеАкты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативноПравовыеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотеряАктуальности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТалоныНаЛьготы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТалоныНаЛьготы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресДомовладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаОтпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияТалона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиЗаявителю</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтпускаУгля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФИОЛьготыДляПодписи1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОЛьготыДляПодписи2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОЛьготыДляПодписи3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОЛьготыДляПодписиОтказ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОЛьготыДляПодписиОтказ2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОСекретарьКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальникУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Решение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Решение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Решение/Ext/ObjectModule.bsl
Функция ОпределитьНомерТалона(Заявитель,ВидЛьготы)      Экспорт

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныНаЛьготыСрезПоследних.Номер КАК НомерТалона,
		|	ТалоныНаЛьготыСрезПоследних.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.ТалоныНаЛьготы.СрезПоследних(
		|			,
		|			ВидЛьготы = &ВидЛьготы
		|				И Заявитель = &Заявитель) КАК ТалоныНаЛьготыСрезПоследних";
	
	Запрос.УстановитьПараметр("Заявитель", Заявитель);
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат " Талон №"+Выборка.НомерТалона + " от " + Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy")+"г.";
	КонецЕсли;
	
	Возврат "";


КонецФункции // ОпределитьНомерТалона()
Функция ОпределитьДатыСтатусаМногодетной(ДанныеЗаполнения) Экспорт
	Результат = Неопределено;
	СтруктураДат = Новый Структура("ДатаНачало,ДатаОкончания");   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоДокументыМС.ДатаВыдачиМС КАК ДатаВыдачиМС,
		|	ЛичноеДелоДокументыМС.ДатаОкончанияМС КАК ДатаОкончанияМС
		|ИЗ
		|	Документ.ЛичноеДело.ДокументыМС КАК ЛичноеДелоДокументыМС
		|ГДЕ
		|	ЛичноеДелоДокументыМС.ФизическоеЛицоМС = ЛичноеДелоДокументыМС.Ссылка.Заявитель
		|	И ЛичноеДелоДокументыМС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураДат.Вставить("ДатаНачало",Выборка.ДатаВыдачиМС);
		СтруктураДат.Вставить("ДатаОкончания",Выборка.ДатаОкончанияМС);
		Результат = СтруктураДат;
	КонецЕсли;
	
	 Возврат Результат;

КонецФункции	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛичноеДело") Тогда
		// Заполнение шапки
		Дата = ДанныеЗаполнения.Дата;
		Заявитель = ДанныеЗаполнения.Заявитель;
		ЛьготнаяКатегория = ДанныеЗаполнения.ЛьготнаяКатегория;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЛьготы = ДанныеЗаполнения.ВидыЛьготыШапка;
		//НомерТалонаДатаВыдачи = ОпределитьНомерТалона(Заявитель);
		НомерЗаявленияДата = Строка(ДокументОснование.НомерЗаявления) +" от " + Строка(Формат(ДокументОснование.ДатаЗаявления,"ДФ=dd.MM.yyyy"))+"г.";
		Если НЕ ЗначениеЗаполнено(ВидЛьготы) И ДанныеЗаполнения.МногодетнаяСемья = Истина Тогда
			 СтруктураДат = ОпределитьДатыСтатусаМногодетной(ДанныеЗаполнения);
			 ДатаНачало = СтруктураДат.ДатаНачало;
			 ДатаОкончания =  СтруктураДат.ДатаОкончания;
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Решение) И ЗначениеЗаполнено(ВидЛьготы) Тогда
			Решение = ДанныеЗаполнения.Решение;
			Если Решение = Перечисления.Решение.Утвердить Тогда
				ДатаНачало = Дата;
				ДатаОкончания = ВидЛьготы.ДатаОкончания;
			КонецЕсли;
		Иначе	
			Решение = Перечисления.Решение.Утвердить;
			Если Решение = Перечисления.Решение.Утвердить Тогда
				ОписаниеРешения = "На основании п 3.2.1. Указа от 13.09.2022 №316у в результате положительного расмотрения заявления
							   |выдается талон на льготное приобритение ТБУ(угля) выдан " + ОпределитьНомерТалона(Заявитель,ВидЛьготы);
			КонецЕсли;	
		КонецЕсли;	
		//Если ДанныеЗаполнения.СформированТалон = Истина Тогда
		//	
		//КонецЕсли;	
		Если Решение = Перечисления.Решение.Отказ Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписиОтказ1 КАК ФИО1,
				|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписиОтказ2 КАК ФИО2
				|ИЗ
				|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
				|ГДЕ
				|	УчетнаяПолитикаСрезПоследних.Организация = &Организация";
	
			Запрос.УстановитьПараметр("Организация", Организация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО1;
				НоваяСтрока.Должность =  Выборка.ФИО1.Должность;
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО2;
				НоваяСтрока.Должность =  Выборка.ФИО2.Должность;
			КонецЦикла;

		Иначе	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи1 КАК ФИО1,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи2 КАК ФИО2,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи3 КАК ФИО3
			|ИЗ
			|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
			|ГДЕ
			|	УчетнаяПолитикаСрезПоследних.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО1;
				НоваяСтрока.Должность =  Выборка.ФИО1.Должность;
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО2;
				НоваяСтрока.Должность =  Выборка.ФИО2.Должность;
				НоваяСтрока = Комиссия.Добавить();
				НоваяСтрока.Сотрудник = Выборка.ФИО3;
				НоваяСтрока.Должность =  Выборка.ФИО3.Должность;
			КонецЦикла;
		КонецЕсли;
	

	КонецЕсли;	
КонецПроцедуры
